Revit 2024 API
BasicFileInfo.IsWorkshared Property
 Checks if the file is workshared.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsWorkshared { get; }
Visual Basic
Public ReadOnly Property IsWorkshared As Boolean
	Get
Visual C++
public:
property bool IsWorkshared {
	bool get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace